Repository: gamondue/GlucoProgs
Catalog: GlucoMan.Maui/Resources/Strings/AppStrings.*.resx
Languages: it

# CalculatorPageTitle
source: Calculator
it: Calcolatore

source: Result
it: Risultato

source: Loading
it: Caricamento

source: Please Wait
it: Attendere prego

source: No Results
it: Nessun risultato trovato

source: Refresh
it: Aggiorna

source: Filter
it: Filtra

source: Sort
it: Ordina

source: Sort By
it: Ordina Per

source: Ascending
it: Crescente

source: Descending
it: Decrescente

source: Name
it: Nome

source: Type
it: Tipo

source: Status
it: Stato

source: Actions
it: Azioni

source: Confirm
it: Conferma

# ConfirmAction
source: Are you sure to proceed?
it: Sei sicuro di voler procedere?

source: Success
it: Successo

source: Failed
it: Fallito

source: Retry
it: Riprova

source: Select All
it: Seleziona Tutto

source: DeselectAll
it: Deseleziona Tutto

source: Show details
it: Mostra dettagli

source: Hide Details
it: Nascondi Dettagli

source: More
it: Altro

source: Less
it: Meno

source: Options
it: Opzioni

source: Preferences
it: Preferenze

source: Help
it: Aiuto

# Copied
source: Copied in clipboard
it: Copiato negli appunti

source: Share
it: Condividi

source: Print
it: Stampa

source: Unsaved Changes
it: Modifiche non salvate

# UnsavedChangesMessage
source: You have non saved changes in current injection\nWhat do you want to do?
it: Hai modifiche non salvate per l'iniezione corrente.\nCosa vuoi fare?

source: Discard
it: Scarta

source: Select Injection
it: Seleziona un'iniezione

# SelectInjectionToSave
source: Select from the list an injection to save
it: Seleziona un'iniezione dall'elenco per salvarla

source: Error during saving
it: Errore durante il salvataggio

# MissingBolusValue
source: Missing bolus' value.\nDo you want to save without it?
it: Valore del bolo mancante.\nVuoi salvare senza?

# MissingInjectionLocation
source: Missing Injection's Location\nDo you want to save without it?
it: Posizione dell'iniezione mancante.\nVuoi salvare senza?

source: Select Insulin Type
it: Seleziona il tipo di insulina di questa iniezione

source: Position Already Set
it: Posizione già impostata

# PositionAlreadySetMessage
source: This injection has a position already set\nDo you want to keep this position for new injection?
it: Questa iniezione ha già una posizione da una selezione precedente.\nVuoi mantenere questa posizione per la nuova iniezione?

source: Keep Position
it: Mantieni Posizione

source: Clear Position
it: Cancella Posizione

source: Configuration Error
it: Errore di Configurazione

# NoShortInsulinConfigured
source: No short insulin configured.\Configure the insulin.\The insulin drug will be set to null.
it: Nessuna insulina rapida configurata.\nConfigura le impostazioni dell'insulina.\nIl farmaco insulinico sarà impostato a null

# NoLongInsulinConfigured
source: No long insulin configured.\nConfigure the insulin.\The insulin drug will be set to null.
it: Nessuna insulina lenta configurata.\nConfigura le impostazioni dell'insulina.\nIl tipo di farmaco insulinico sarà impostato a null

# DeleteInjectionConfirm
source: Should I delete injection {1}, insulin {0}?
it: Devo eliminare l'iniezione di {1}, insulina {0}?

# ChooseInjectionToDelete
source: Choose the Injection to Delete
it: Scegli un'iniezione da eliminare

source: Saving not possible
it: Salvataggio non possibile

source: Front
it: Davanti

source: Hands
it: Mani

source: Sensor
it: Sensore

source: Sensors
it: Sensori

source: Abort
it: Annulla

source: Value discrepancy
it: Discrepanza valori

# ValueDiscrepancyMessage
source: The value of total Carbohydrates and/or accuracy are different from those calculated with the single foods.\nShould we save the displayed values or those calculated?
it: Il valore dei Carboidrati totali e/o dell'accuratezza è diverso da quello calcolato con i singoli alimenti.\nSalviamo i valori visualizzati o quelli calcolati?

source: Use Calculated
it: Usa Calcolati

source: Keep Displayed
it: Mantieni Visualizzati

# FailedToSaveMealData
source: Failed to save meal data. This might be due to database connectivity issues. Check logs for details.
it: Impossibile salvare i dati del pasto. Potrebbe essere dovuto a problemi di connessione al database. Controlla i log per i dettagli.

# FailedToAddFood
source: Failed to add food to meal
it: Impossibile aggiungere l'alimento al pasto

# FailedToAddFoodDetails
source: Failed to add food to meal. Check logs for details.
it: Impossibile aggiungere l'alimento al pasto. Controlla i log per i dettagli.

# FailedToImportRecipe
source: Failed to import recipe: {0}
it: Impossibile importare la ricetta: {0}

# FailedToCalculateTotals
source: Failed to calculate meal totals. Check logs for details.
it: Impossibile calcolare i totali del pasto. Controlla i log per i dettagli.

# FailedToOpenWeighFood
source: Failed to open weigh food page. Check logs for details.
it: Impossibile aprire la pagina di pesatura alimento. Controlla i log per i dettagli.

# FailedToOpenInjections
source: Failed to open injections page. Check logs for details.
it: Impossibile aprire la pagina iniezioni. Controlla i log per i dettagli.

source: Deletion not possible
it: Eliminazione non possibile

# ChooseMealToDelete
source: Choose the meal to delete
it: Scegli il pasto da eliminare

# DeleteMealConfirm
source: Should we delete the meal begun at {0}, Id {1}?
it: Eliminare il pasto iniziato alle {0}, Id {1}?

# SelectOneMealFromList
source: Select one meal from the list
it: Seleziona un pasto dall'elenco

# ChooseMealToSave
source: Choose a meal to save
it: Scegli un pasto da salvare

# ChooseMealInGrid
source: Choose a meal in the grid
it: Scegli un pasto nella griglia

# DeleteGlucoseMeasurementConfirm
source: Should I delete the measurement {0}, {1}, Id {2}?
it: Eliminare la misurazione {0}, {1}, Id {2}?

# ChooseGlucoseMeasurementToDelete
source: Choose a measurement to delete
it: Scegli una misurazione da eliminare

# SelectOneGlucoseMeasurement
source: Select one glucose measurement from the list
it: Seleziona una misurazione glicemica dall'elenco

# ChooseGlucoseMeasurementToSave
source: Choose a measurement to save
it: Scegli una misurazione da salvare

# SelectOneFoodFromList
source: Select one food from the list
it: Seleziona un alimento dall'elenco

# ChooseFoodToSave
source: Choose a food to save
it: Scegli un alimento da salvare

# FoodNameCannotBeEmpty
source: Food name cannot be empty.\nPlease enter a name for the food.
it: Il nome dell'alimento non può essere vuoto.\nInserisci un nome per l'alimento.

# FoodNameCannotBeEmptyBeforeChoosing
source: Food name cannot be empty.\nPlease enter a name for the food before choosing.
it: Il nome dell'alimento non può essere vuoto.\nInserisci un nome prima di scegliere.

# CarbohydratesMustBeSet
source: Carbohydrates of a new food must be set and greater than zero.\nFood not saved
it: I carboidrati di un nuovo alimento devono essere impostati e maggiori di zero.\nAlimento non salvato

# DeleteFoodConfirm
source: Should I delete the food {0}, CHO% {1}, Id {2}?
it: Eliminare l'alimento {0}, CHO% {1}, Id {2}?

source: Confirm delete
it: Conferma eliminazione

# CannotClosePage
source: Cannot close page: {0}
it: Impossibile chiudere la pagina: {0}

# UnitApplicabilityTitle
source: Unit Applicability
it: Applicabilità della Unità

# UnitApplicabilityMessage
source: Will this new Unit be applicable to all foods or just to this Food?
it: Questa nuova unità deve essere applicabile a tutti i cibi o solo a questo?

# UnitApplicabilityAll
source: All
it: Tutte

# UnitApplicabilityThis
source: This
it: Questa

# UnitSymbolExistsMessage
source: The unit symbol already exists, give the new unit a unique symbol
it: Il simbolo dell'Unità esiste già. Dare un simbolo univoco a questa unità.

# UnitSaveFailedMessage
source: The saving of the new unit failed. New unit not saved
it: Errore nel salvataggio della nuova Unità. Nuova unità non salvata.

# SelectManufacturerToRemove
source: Please select a manufacturer to remove
it: Scegliere il Produttore da cancellare

# ManufacturerDeleteTitle
source: Delete Manufacturer
it: Cancella il Produttore

# ManufacturerDeleteMessage
source: Do you want to delete the manufacturer from the whole database or just from this food?
it: Vuoi cancellare il Produttore da tutto il database o solo da questo cibo?

# ManufacturerDeleteThis
source: This
it: Questo

# ManufacturerDeleteWhole
source: Whole
it: Tutto

source: Glucose
it: Glicemia

source: Short insulin
it: Insulina rapida

source: Long insulin
it: Insulina lenta

# TooltipGlucose
source: Glucose: select to view glucose measurements data
it: Glicemia: seleziona per visualizzare le misurazioni del glucosio

# TooltipShortInsulin
source: Short insulin: select to view rapid-acting insulin injections data
it: Insulina rapida: seleziona per visualizzare le iniezioni di insulina rapida

# TooltipLongInsulin
source: Long insulin: select to view long-acting insulin injections data
it: Insulina lenta: seleziona per visualizzare le iniezioni di insulina a lunga durata

# TooltipFoodsSelection
source: Foods: select to view individual foods data
it: Alimenti: seleziona per visualizzare i dati dei singoli alimenti

# TooltipMealsSelection
source: Meals: select to view complete meals data
it: Pasti: seleziona per visualizzare i dati dei pasti

# TooltipRecipesSelection
source: Recipes: select to view recipes data
it: Ricette: seleziona per visualizzare i dati delle ricette

source: Select time range:
it: Seleziona intervallo di tempo:

# FromLabel
source: From:
it: Da:

# DateLabel
source: Date:
it: Data:

# TooltipFromDate
source: From date: select the start date for data analysis. This date has no influence on graph.
it: Data di inizio: seleziona la data iniziale per l'analisi. Questa data non influenza il grafico.

# TooltipToDate
source: To date: select the finish date for data analysis or visualized date for graph.
it: Data di fine: seleziona la data finale per l'analisi o la data visualizzata per il grafico.

# TooltipStatistics
source: Statistics: click to open statistics page with numerical data analysis
it: Statistiche: clicca per aprire la pagina delle statistiche con analisi numeriche

# TooltipChart
source: Chart: click to open chart page with graphical data visualization
it: Grafico: clicca per aprire la pagina dei grafici con visualizzazione grafica

# ImportSensorTitle
source: Import data from FreeStyle Libre sensor
it: Importa dati dal sensore FreeStyle Libre

# TooltipImportSensor
source: Import from sensor: click to import glucose measurements from csv file of FreeStyle Libre continuous glucose monitor sensor
it: Importa dal sensore: clicca per importare misurazioni del glucosio da file csv del sensore Freestyle Libre

# InvalidDateRangeTitle
source: Invalid Date Range
it: Intervallo di date non valido

# InvalidDateRangeMessage
source: The 'From' date cannot be later than the 'To' date.\nTo date moved to 1 day more than from date
it: La data 'Da' non può essere successiva alla data 'A'.\nLa data 'A' è stata impostata a 1 giorno più della data 'Da'

# ImportGlucoseConfirmTitle
source: Import glucose data from sensor
it: Importa dati dal sensore

# ImportGlucoseConfirmMessage
source: Select the file taken from your LibreView Web account.\n\nThe CSV file should contain glucose measurements from your Freestyle Libre sensor.\n\nContinue?
it: Seleziona il file scaricato dal tuo account LibreView Web.\n\nIl file CSV deve contenere le misurazioni del glucosio dal sensore Freestyle Libre.\n\nContinuare?

# ImportFinishedTitle
source: Import finished
it: Importazione completata

# ImportErrorTitle
source: Error
it: Errore

# BtnNowTooltip
source: Enter Now time: copies the current day and time to the date of the current glucose measurement
it: Inserisci ora attuale: copia giorno e ora correnti nella data della misurazione glicemica corrente

# BtnNextTooltip
source: Enter the next glucose measurement: moves the current glucose measurement into the previous and copies time now in latest glucose measurement
it: Inserisci la prossima misurazione: sposta la misurazione corrente in precedente e copia l'ora corrente nella misurazione più recente

# BtnReadTooltip
source: Read: reads the last two glucose measurements from the database
it: Leggi: legge le ultime due misurazioni di glicemia dal database

# BtnPredictTooltip
source: Predict: predicts the time at which the glucose will reach the value for alarm (prediction by linear extrapolation, use with caution)
it: Prevedi: stima l'ora in cui la glicemia raggiungerà il valore di allarme (estrapolazione lineare, usare solo in condizioni molto rigorose)

# GlucoseForAlarmLabel
source: Glucose for alarm
it: Glicemia per allarme

# AlarmAdvanceTimeLabel
source: Alarm advance time [min]
it: Anticipo allarme [min]

# TooltipGlucoseTarget
source: Alarm value: low glucose at which we want to take action against hypoglycemia
it: Valore allarme: glicemia bassa al quale vogliamo intervenire

# TooltipAlarmAdvanceTime
source: Time advance: time of anticipated alarm, with respect to the alarm value time [min]
it: Anticipo: minuti di anticipo rispetto all'ora di allarme

# MeasurementsHeader
source: Measurements of glucose and time
it: Misurazioni di glicemia e tempo

# ColGlucose
source: Glucose
it: Glicemia

# ColHour
source: Hour
it: Ora

# ColMinute
source: Minute
it: Minuto

# PlaceholderGlucMeas
source: gluc.meas.
it: mis.glic.

# PlaceholderHour
source: hour
it: ora

# PlaceholderMinute
source: minute
it: minuto

# CurrentMeasurementLabel
source: current measurem.
it: mis. corrente

# PreviousMeasurementLabel
source: previous measurem.
it: mis. precedente

# TooltipGlucoseLast
source: Glucose measured the last time
it: Glicemia misurata l'ultima volta

# TooltipHourLast
source: Hours of the last measurement
it: Ore dell'ultima misurazione

# TooltipMinuteLast
source: Minutes of the last measurement
it: Minuti dell'ultima misurazione

# TooltipGlucosePrevious
source: Glucose measured the previous time
it: Glicemia misurata la volta precedente

# TooltipHourPrevious
source: Hours of the previous measurement
it: Ore della misurazione precedente

# TooltipMinutePrevious
source: Minutes of the previous measurement
it: Minuti della misurazione precedente

# TooltipSlope
source: Slope: rate of change of glucose [glucose units/hour]
it: Pendenza: velocità di variazione della glicemia [unità glicemia/ora]

# SlopeUnitLabel
source: Slope [gluc/h]
it: Pendenza [glic/ora]

# ExpectedTimeHeader
source: Expected time of target glucose achievement
it: Ora prevista per raggiungere la glicemia obiettivo

# TooltipPredictedHour
source: Hours of the predicted 'low glucose' event
it: Ore dell'evento ipoglicemia previsto

# TooltipPredictedMinute
source: Minutes of the predicted 'low glucose' event
it: Minuti dell'evento ipoglicemia previsto

# AlarmTimeHeader
source: Alarm time
it: Ora allarme

# TooltipAlarmHour
source: Hours of the alarm event for low glucose
it: Ore dell'evento di allarme per glicemia bassa

# TooltipAlarmMinute
source: Minutes of the alarm event for low glucose
it: Minuti dell'evento di allarme per glicemia bassa

# CalcDescription
source: Calculation of a future glucose value, starting from now and with current slope
it: Calcolo di un valore glicemico futuro, a partire da ora e con la pendenza corrente

# BtnCalcTooltip
source: Calculates the future glucose after 'Time diff' minutes from 'current measurement' time (prediction uses the shown 'slope'). USE THIS WITH CAUTION!
it: Calcola la glicemia futura dopo 'Time diff' minuti dalla misurazione corrente (usa la pendenza mostrata). USARE CON CAUTELA!

# TimeDiffLabel
source: Time diff.[min]
it: Delta tempo [min]

# FutureTimeLabel
source: Future time
it: Ora futura

# FutureGlucLabel
source: Future gluc
it: Glicemia futura

# FutureTimeDiffTooltip
source: Difference in minutes for prediction. From current measurement time
it: Differenza in minuti per la previsione. A partire dalla misurazione corrente

# FutureTimeTooltip
source: Hour and time of prediction
it: Ora e tempo della previsione

# FutureGlucoseTooltip
source: Predicted glucose at 'future time' (USE WITH CAUTION!)
it: Glicemia prevista all'ora futura (USARE CON CAUTELA!)

# AboutAppTitleLabel
source: Application
it: Applicazione

# AboutVersionLabel
source: Version
it: Versione

# AboutAuthorLabel
source: Author
it: Autore

# AboutContactLabel
source: Contact
it: Contatto

# AboutLicenseLabel
source: License
it: Licenza

# TooltipAboutVersion
source: The application version string
it: Stringa della versione dell'applicazione

# TooltipAboutAuthor
source: Author name and contact information
it: Nome dell'autore e informazioni di contatto

# MiscellaneousPageTitle
source: Miscellaneous Functions
it: Funzioni Varie

# MiscellaneousHeader
source: Miscellaneous utilities and tools
it: Utilità e strumenti vari

# MiscClearLogsLabel
source: Clear Logs
it: Cancella Log

# MiscRestoreLabel
source: Restore
it: Ripristina

# TooltipClearLogs
source: Deletes application log files
it: Elimina i file di log dell'applicazione

# TooltipBackup
source: Creates a backup of the application database and settings
it: Crea un backup del database e delle impostazioni dell'app

# TooltipRestore
source: Restores the application database and settings from a backup
it: Ripristina il database e le impostazioni dell'app da un backup

source: Done
it: Fatto

# AppShortScope
source: GlucoMan is a Glucose Manager program for the diabetic person
it: GlucoMan (Glucose Manager) è un programma per la gestione del glucosio per le persone diabetiche

# AppAboutParagrah1
source: Helps with the daily operations needed to manage carbs counting. Currently manages data related to measured glucose, carbohydrates consumed during meals, foods, insulin injections.
it: Aiuta nelle operazioni quotidiane che servono per gestire la conta dei carboidrati. Attualmente gestisce dati che riguardano il glucosio del sangue misurato, i carboidrati ingeriti ai pasti, i cibi e le iniezioni di insulina.

# AppAboutParagrah2
source: Calculates: the insulin bolus based on carbohydrates to be consumed during meals, the foods to eat to reach the desired carbohydrates and also a rough prediction of when blood sugar will reach a hypo value. It can visualize a graph of the past value of glucose and of the other paramaters.
it: Calcola: il bolo di insulina da iniettare, basandosi sui carboidrati da ingerire durante i pasti, la quantità di cibo da ingerire per raggiungere i carboidrati desiderati, una previsione approssimativa del momento in cui si raggiungerà l'ipoglicemia. Visualizza un grafico temporale del glucosio e degli altri parametri

# AppAboutParagrah3
source: The program has provisions to manage recipes and helps in weighing the foods. Prototype functions are also included in the code but they are still in very preliminary development.
it: Il programma ha la possibilità di gestire ricette per cibo ed aiutare nella pesatura dei cibi. Sono anche presenti funzioni a stato prototipale che non sono ancora state implementate.

# CalcEscape
source: Escape
it: Annulla

# ClickableImagePageTitle
source: Select Position
it: Seleziona Posizione

# TooltipChoosePosition
source: Choose: closes the page remembering the current position, that will be saved in the other page
it: Scegli: chiude la pagina memorizzando la posizione corrente, che verrà salvata nell'altra pagina

# TooltipEscapePosition
source: Escape: closes the page forgetting the current position
it: Annulla: chiude la pagina dimenticando la posizione corrente

# TooltipEditReferencePoints
source: Edits the reference points if checked
it: Modifica i punti di riferimento se selezionato

# EditLabel
source: Edit
it: Modifica

# TooltipDeleteReferencePoints
source: Deletes the reference points if checked
it: Elimina i punti di riferimento se selezionato

# DeleteLabel
source: Delete
it: Elimina

# SaveRefPoints
source: Save ref.p.
it: Salva p.rif.

# TooltipSaveRefPoints
source: Saves the reference points
it: Salva i punti di riferimento

# ClearRefPoints
source: Clear ref.p.
it: Cancella p.rif.

# TooltipClearRefPoints
source: Clears all reference points
it: Cancella tutti i punti di riferimento

# TooltipClickImage
source: Click on this image to set the point
it: Clicca sull'immagine per impostare il punto

source: Container data
it: Dati contenitore

source: Name of container
it: Nome del contenitore

# WeightGrams
source: Weight [g]
it: Peso [g]

# ContainerNamePlaceholder
source: Name (e.g. 'Small pot')
it: Nome (es. 'Pentolino')

# TooltipContainerName
source: Name: short name of this container
it: Nome: nome breve di questo contenitore

# WeightPlaceholder
source: Weight
it: Peso

# TooltipContainerWeight
source: Weight: weight of the container in grams [g]
it: Peso: peso del contenitore in grammi [g]

source: Photo
it: Foto

# TooltipBack
source: Back: return to previous page without selecting
it: Indietro: torna alla pagina precedente senza selezionare

# TooltipChoose
source: Choose: select this container and return to previous page
it: Scegli: seleziona questo contenitore e torna alla pagina precedente

# TooltipSave
source: Save: saves this container's data into the database
it: Salva: salva i dati di questo contenitore nel database

# TooltipTakePicture
source: Picture: take a photo of the container with the camera
it: Foto: scatta una foto del contenitore con la fotocamera

# TooltipClearFields
source: Clear fields: clears all data in the UI
it: Cancella campi: cancella tutti i dati nell'interfaccia

# TooltipPlus
source: Plus: adds a new container with data from the UI
it: Più: aggiunge un nuovo contenitore con i dati dall'interfaccia

# TooltipMinus
source: Minus: clear fields or remove selected container
it: Meno: cancella i campi o rimuove il contenitore selezionato

source: Saved containers
it: Contenitori salvati

# TooltipContainersList
source: List of the containers saved in database
it: Elenco dei contenitori salvati nel database

# PhotoColumn
source: Photo
it: Foto

# NameColumn
source: Name
it: Nome

# StatisticsPageHeader
source: Statistics Page
it: Pagina Statistiche

source: Identification 1
it: Identificazione 1

source: Identification 2
it: Identificazione 2

# Method1SingleTau
source: Method 1 (Single τ)
it: Metodo 1 (Singolo τ)

# Method2TwoTau
source: Method 2 (Two τ)
it: Metodo 2 (Due τ)

# AutoregressiveA
source: a (autoregressive):
it: a (autoregressivo):

# CHOGainB1
source: b1 (CHO gain):
it: b1 (guadagno CHO):

# InsulinGainB2
source: b2 (Insulin gain):
it: b2 (guadagno Insulina):

source: Delay CHO [samples]:
it: Ritardo CHO [campioni]:

source: Delay Insulin [samples]:
it: Ritardo Insulina [campioni]:

# TimeConstantT
source: Time constant T [s]:
it: Costante di tempo T [s]:

source: SSE (fit error):
it: SSE (errore adattamento):

# CHODelaySamplesMeanSd
source: CHO - Delay [samples] (μ ± σ):
it: CHO - Ritardo [campioni] (μ ± σ):

# CHOR2Avg
source: CHO - R² avg:
it: CHO - R² medio:

# CHOSegmentsCount
source: CHO - # Segments:
it: CHO - # Segmenti:

# InsulinTauMeanSd
source: Insulin - τ [s] (μ ± σ):
it: Insulina - τ [s] (μ ± σ):

# InsulinGainMeanSd
source: Insulin - k (μ ± σ):
it: Insulina - k (μ ± σ):

# InsulinDelaySamplesMeanSd
source: Insulin - Delay [samples] (μ ± σ):
it: Insulina - Ritardo [campioni] (μ ± σ):

# InsulinOffsetMeanSd
source: Insulin - Offset (μ ± σ):
it: Insulina - Offset (μ ± σ):

# InsulinR2Avg
source: Insulin - R² avg:
it: Insulina - R² medio:

# InsulinSegmentsCount
source: Insulin - # Segments:
it: Insulina - # Segmenti:

# WeighingYourPortion
source: Weighing your portion of food
it: Pesatura della tua porzione di cibo

# TooltipChooseWeighFood
source: Choose: save changes, return the modified food data and go back
it: Scegli: salva le modifiche, restituisce i dati dell'alimento modificati e torna indietro
