Repository: gamondue/GlucoProgs
Catalog: GlucoMan.Maui/Resources/Strings/AppStrings.*.resx
Languages: it

source: Cancel
it: Annulla

source: Save
it: Salva

source: Delete
it: Elimina

source: Close
it: Chiudi

source: Yes
it: Si

source: Error
it: Errore

source: Warning
it: Attenzione

# Info
source: Information
it: Informazione

source: Edit
it: Modifica

source: New
it: Nuovo

source: Search
it: Cerca

source: Clear
it: Pulisci

source: Back
it: Dietro

source: Next
it: Avanti

source: Settings
it: Impostazioni

source: Language
it: Lingua

# LanguageEnglish
source: English
it: Inglese

# LanguageItalian
source: Italian
it: Italiano

source: Select Language
it: Seleziona Lingua

source: Configuration
it: Configurazione

source: Chart
it: Grafico

source: Graph
it: Grafico

source: Statistics
it: Statistiche

source: Foods
it: Alimenti

source: Recipes
it: Ricette

source: Meals
it: Pasti

source: Calculator
it: Calcolatore

source: About
it: Informazioni

source: Alarm
it: Allarme

source: Containers
it: Contenitori

# TooltipPhysicalActivity
source: Physical Activity: opens the page of the tools for tracking physical activity for glucose consumption
it: Attività Fisica: apre la pagina che permette di tenere traccia dell'attività fisica per il consumo di glucosio

source: Miscellaneous Functions
it: Funzioni Varie

source: Glucose Level
it: Livello di Glucosio

source: Blood Sugar
it: Glicemia

source: Blood Glucose
it: Glucosio nel sangue

source: Insulin
it: Insulina

source: Bolus
it: Bolo

source: Injection
it: Iniezione

source: Carbohydrates
it: Carboidrati

source: Carbs
it: Carb.

source: Target
it: Obiettivo

source: Target Glucose
it: Glicemia Obiettivo

source: Prediction
it: Previsione

# HypoPrediction
source: Hypoglycemia Prediction
it: Previsione Ipoglicemia

source: Food to Hit Target
it: Cibo per Raggiungere l'Obiettivo

source: Food
it: Alimento

source: Food Name
it: Nome cibo

source: Quantity
it: Quantità

source: Weight
it: Peso

source: Weigh Food
it: Pesa Alimento

source: Recipe
it: Ricetta

source: Recipe Name
it: Nome della ricetta

source: Ingredients
it: Ingredienti

source: Total Sugar
it: Zuccheri Totali

source: Total Carbs
it: Carboidrati Totali

source: Meal
it: Pasto

source: Meal Type
it: Tipo di Pasto

source: Breakfast
it: Colazione

source: Lunch
it: Pranzo

source: Dinner
it: Cena

source: Snack
it: Spuntino

source: Date
it: Data

source: Time
it: Ora

source: Date/Time
it: Data/Ora

source: Now
it: Adesso

source: Today
it: Oggi

source: grams
it: grammi

source: units
it: unità

# RequiredField
source: This field is required
it: Questo campo è obbligatorio

source: Invalid value
it: Valore non valido

# SaveSuccess
source: Data saved successfully
it: Dati salvati con successo

# SaveError
source: Error saving data
it: Errore durante il salvataggio

# DeleteConfirm
source: Are you sure you want to delete this item?
it: Sei sicuro di voler eliminare questo elemento?

# DeleteSuccess
source: Item deleted successfully
it: Elemento eliminato con successo

# LoadError
source: Error loading data
it: Errore durante il caricamento

source: No data available
it: Nessun dato disponibile

source: Add
it: Aggiungi

source: Remove
it: Rimuovi

source: Update
it: Aggiorna

source: Calculate
it: Calcola

source: Get Last
it: Ottieni Ultimo

source: Details
it: Dettagli

source: Take Picture
it: Scatta Foto

source: Choose Picture
it: Scegli Foto

source: Crop Photo
it: Ritaglia Foto

source: Version
it: Versione

source: Author
it: Autore

source: License
it: Licenza

# TooltipBloodGlucose
source: Blood glucose: opens the page of glucose measurement events
it: Glicemia: apre la pagina degli eventi di misurazione del glucosio

# TooltipInsulinCalculation
source: Insulin calculation: opens a page that calculates the quantity of insulin to inject before a meal
it: Calcolo insulina: apre una pagina che calcola la quantità di insulina da iniettare prima di un pasto

# TooltipInjections
source: Injections: opens the page of past and present injections
it: Iniezioni: apre la pagina delle iniezioni passate e presenti

# TooltipFoodToHitTarget
source: Food to hit Target: opens the page that calculates the food one need to eat to hit a carbohydrates target
it: Cibo per raggiungere l'obiettivo: apre la pagina che calcola il cibo necessario per raggiungere un obiettivo di carboidrati

# TooltipMeals
source: Meals: opens the page of meals done in the past
it: Pasti: apre la pagina dei pasti consumati in passato

# TooltipNewMeal
source: Meal: opens a new meal page
it: Pasto: apre una nuova pagina pasto

# TooltipFoods
source: Foods: opens the page for foods management
it: Alimenti: apre la pagina per la gestione degli alimenti

# TooltipRecipes
source: Recipes: opens the page of recipes management
it: Ricette: apre la pagina di gestione delle ricette

# TooltipChartsAndStatistics
source: Charts and Statistics: opens the page that searches past data, makes statistics and charts
it: Grafici e Statistiche: apre la pagina che cerca dati passati, crea statistiche e grafici

# TooltipPrediction
source: Prediction: opens the page that makes a simple prediction of the time of an hypoglicemia episode
it: Previsione: apre la pagina che fa una semplice previsione del momento di un episodio di ipoglicemia

# TooltipMiscellaneous
source: Miscellaneous: opens the page of miscellaneous functions
it: Varie: apre la pagina delle funzioni varie

# TooltipAlarms
source: Alarms: opens the page of the alarms settings
it: Allarmi: apre la pagina delle impostazioni degli allarmi

# TooltipConfigurations
source: Configurations: opens the page that assigns the program parameters
it: Configurazioni: apre la pagina che assegna i parametri del programma

# TooltipAbout
source: About: opens the page of information about this program
it: Informazioni: apre la pagina di informazioni su questo programma

source: Calculate Insulin
it: Calcola Insulina

source: Injections
it: Iniezioni

source: New Meal
it: Nuovo Pasto

source: Charts and Statistics
it: Grafici e Statistiche

source: Alarms
it: Allarmi

source: Configure
it: Configura

# GlucoseMeasurementsTitle
source: Glucose Measurements
it: Misurazioni Glicemia

source: Glucose [mg/dL]
it: Glicemia [mg/dL]

source: Measurement time
it: Ora misurazione

source: Add with Now as time
it: Aggiungi con l'ora corrente

source: List of past glucose measurements
it: Elenco misurazioni glicemia passate

# GlucColumn
source: Gluc.[mg/dL]
it: Glic.[mg/dL]

# TooltipGlucoseMeasurement
source: Glucose measurement taken from the instrument
it: Misurazione glicemica rilevata dallo strumento

# TooltipDateOfMeasurement
source: Date of measurement of glucose
it: Data della misurazione della glicemia

# TooltipTimeOfMeasurement
source: Time of measurement of glucose
it: Ora della misurazione della glicemia

# TooltipDateAndTimeOfMeasurement
source: Date and time of measurement of glucose
it: Data e ora della misurazione della glicemia

# TooltipNoteAboutMeasurement
source: Note about the measurement
it: Nota sulla misurazione

# TooltipNowButton
source: Now: sets the date and time at the current instant
it: Adesso: imposta data e ora all'istante corrente

# TooltipPlusButton
source: Plus: adds a new measurement with the data taken from UI
it: Più: aggiunge una nuova misurazione con i dati dall'interfaccia

# TooltipMinusButton
source: Minus: deletes the selected measurement
it: Meno: elimina la misurazione selezionata

# TooltipClearData
source: Clear Data: deletes the fields in the UI
it: Pulisci Dati: cancella i campi nell'interfaccia

# TooltipInjectionSaveButton
source: Save: saves the data of the current food
it: Salva: salva i dati del cibo attuale

# TooltipRecipeSaveButton
source: Save: saves the data of the current recipe
it: Salva: salva i dati della ricetta attuale

# TooltipFoodSaveButton
source: Save: saves the data of the current injection
it: Salva: salva i dati della iniezione

# TooltipMealSaveButton
source: Save: saves the data of the current meal
it: Salva: salva i dati del pasto

# TooltipGlucoseSaveButton
source: Save: saves the data of the current glucose measurement
it: Salva: salva i dati della misurazione corrente di glicemia

# InsulinBolusCalculationTitle
source: Insulin bolus calculation
it: Calcolo bolo insulinico

# RatioCHOInsulin
source: Ratio CHO/insulin (from dietist)
it: Rapporto CHO / insulina (dal dietista)

source: Sensitivity to insulin
it: Sensibilita all'insulina

source: Embarked insulin
it: Insulina residua

source: Premeal Gluc
it: Glic. prepasto

source: Target Gluc
it: Glic. obiettivo

# GlucToCorrect
source: Gl. to correct
it: Glic. da correggere

source: CHO to eat
it: CHO da mangiare

source: Type of meal
it: Tipo di pasto

source: Correction insulin
it: Insulina di correzione

source: CHO insulin
it: Insulina CHO

source: Total excl. embarked
it: Totale escl. residua

source: Total bolus insulin
it: Insulina bolo totale

source: Set param.
it: Imposta param.

# TooltipBreakfastCHOInsulinRatio
source: Morning CHO/insulin: carbohydrates per unit of insulin - breakfast time [CHO/UI]
it: CHO/insulina mattutino: carboidrati per unita di insulina - colazione [CHO/UI]

# TooltipLunchCHOInsulinRatio
source: Midday CHO/insulin: carbohydrates per unit of insulin - lunch time [CHO/UI]
it: CHO/insulina mezzogiorno: carboidrati per unita di insulina - pranzo [CHO/UI]

# TooltipDinnerCHOInsulinRatio
source: Evening CHO/insulin: carbohydrates per unit of insulin - dinner time [CHO/UI]
it: CHO/insulina serale: carboidrati per unita di insulina - cena [CHO/UI]

# TooltipCalculateBolus
source: Calculate bolus: calculates the insulin bolus for this meal
it: Calcola bolo: calcola il bolo insulinico per questo pasto

# TooltipInsulinCorrectionSensitivity
source: Blood glucose/insulin: glucose processed by one unit of insulin [mg/(dl*UI)]
it: Glicemia/insulina: glucosio elaborato da una unita di insulina [mg/(dl*UI)]

# TooltipParametersButton
source: Parameters: opens the page that calculates or sets sensitivity parameters
it: Parametri: apre la pagina che calcola o imposta i parametri di sensibilita

# TooltipEmbarkedInsulinLabel
source: Embarked insulin: amount of insulin taken previously and still effective
it: Insulina residua: quantità di insulina assunta in precedenza e ancora efficace (embarked insulin)

# TooltipRoundButton
source: Round: calculate the CHO to eat to inject a integer value of the insulin bolus
it: Arrotonda insulina: calcola i CHO da mangiare per iniettare un valore intero del bolo insulinico

# TooltipCurrentGlucose
source: Current glucose: glucose measured before the meal
it: Glicemia attuale: glicemia misurata prima del pasto

# TooltipTargetGlucose
source: Target: glucose to reach with calculated bolus
it: Obiettivo: glicemia da raggiungere con il bolo calcolato

# TooltipGlucoseToBeCorrected
source: To correct: glucose to be corrected, difference of the target value minus the current value
it: Da correggere: glicemia da correggere, differenza fra il valore obietto e quello attuale della glicemia

# TooltipTargetCHO
source: Target CHO: carobydrates amount to eat to reach target glucose level
it: CHO obiettivo: quantita di carboidrati da mangiare per raggiungere il livello glicemico obiettivo

# TooltipReadGlucose
source: Read glucose: read the last value of blood glucose stored in database
it: Leggi glicemia: legge l'ultimo valore di glicemia memorizzato nel database

# TooltipMeasureGlucose
source: Measure Glucose: opens the page that stores in database the measured glucose
it: Misura Glicemia: apre la pagina che memorizza nel database la glicemia misurata

# TooltipInjectionButton
source: Injection: opens the page of injections to make a new
it: Iniezione: apre la pagina delle iniezioni per crearne una nuova

# TooltipReadCHO
source: Read CHO: reads the value of carbohydrates of the current meal
it: Leggi CHO: legge il valore dei carboidrati del pasto corrente

# TooltipMealTypeBreakfast
source: Type of meal: breakfast
it: Tipo di pasto: colazione

# TooltipMealTypeLunch
source: Type of meal: lunch
it: Tipo di pasto: pranzo

# TooltipMealTypeDinner
source: Type of meal: dinner
it: Tipo di pasto: cena

# TooltipMealTypeSnack
source: Type of meal: snack
it: Tipo di pasto: spuntino

# TooltipCorrectionInsulinLabel
source: Correction insulin: insulin that brings the bool glucose level to target glucose
it: Insulina di correzione: insulina che porta il livello glicemico alla glicemia obiettivo

# TooltipCHOInsulinLabel
source: CHO insulin: insulin that reduces amount of carbohydrates ingested during meal
it: Insulina CHO: insulina che riduce la quantita di carboidrati ingeriti durante il pasto

# TooltipTotalExclEmbarked
source: Total excluding embarked: insulin of the bolus when no insulin in left in the body (no embarked)
it: Totale esclusa residua: insulina del bolo quando non c'e insulina rimasta nel corpo (no residua)

# TooltipBolusLabel
source: Bolus: calculated insulin bolus to inject
it: Bolo: bolo insulinico calcolato da iniettare

# MealsPageTitle
source: Meals
it: Pasti

source: Meals List
it: Elenco Pasti

source: Filter by Date
it: Filtra per Data

source: From
it: Da

source: To
it: A

source: Apply
it: Applica

# MealPageTitle
source: Meal
it: Pasto

# MealDateTime
source: Meal's Date/Time
it: Data/Ora Pasto

source: Total Carbohydrates
it: Carboidrati Totali

source: Add Food
it: Aggiungi Alimento

source: Remove Food
it: Rimuovi Alimento

source: Notes
it: Note

# FoodsPageTitle
source: Foods
it: Alimenti

source: Food List
it: Elenco Alimenti

source: Search Food
it: Cerca Alimento

source: Category
it: Categoria

source: Carbs per 100g
it: Carb. per 100g

# FoodPageTitle
source: Food
it: Alimento

source: Manufacturer
it: Produttore

source: Protein
it: Proteine

source: Fat
it: Grassi

source: Fiber
it: Fibre

source: Calories
it: Calorie

source: Sugar
it: Zuccheri

# FoodToHitTargetCarbsPageTitle
source: Food to reach target Carbohydrates
it: Cibo per Raggiungere Carboidrati Obiettivo

# TooltipCalculateFoodGrams
source: Food Calculator: calculates the grams of selected food that you have to eat to reach target carbohydrates
it: Calcolatore cibo: calcola i grammi necessari per raggiungere i carboidrati obiettivo

# TargetCHO
source: Target CHO [g]
it: CHO obiettivo [g]

# CHOAlreadyTaken
source: Already ingested carbohydrates [g]
it: CHO già consumati [g]

# TooltipCHOAlreadyTaken
source: Already ingested carbohydrates [g]
it: Carboidrati già consumati [g]

# TooltipCHOFoodPercent
source: Carbohydrates percent of the food we want to eat to reach the target carbohydrates[%]
it: Percentuale carboidrati del cibo per raggiungere l'obiettivo [%]

# FoodToCompleteCHOBudget
source: Food to eat to complete the CHO budget
it: Cibo da mangiare per completare il budget CHO

# TooltipFoodToHitTargetGrams
source: Shot name of the food chosen to reach the target CHO
it: Nome breve dell'alimento per raggiungere i CHO obiettivo

# TooltipReadTargetCHO
source: Read target CHO: reads from the bolus calc's page the target CHO
it: Leggi CHO obiettivo: legge dalla pagina di calcolo bolo

# TooltipReadEatenCHO
source: Reads from the meals' page the CHO already eaten
it: Legge dalla pagina dei pasti i CHO già mangiati

# TooltipReadFoodCHO
source: Reads from the meals' page the CHO % of the selected food
it: Legge dalla pagina dei pasti la % CHO dell'alimento selezionato

# TooltipReadAll
source: Read all the parameters useful to calculate remaining CHO
it: Legge tutti i parametri per calcolare i CHO rimanenti

# CHOLeftToTake
source: Remaining CHO: CHO rimanenti [g]
it: CHO rimanenti [g]

# TooltipChoLeft
source: Remaining CHO: carbohydrates missing to eat to reach the target
it: CHO rimanenti: carboidrati calcolati per raggiungere l'obiettivo

# FoodToHitTargetCHOGrams
source: Food to eat to reach target CHO [g]
it: Cibo da mangiare per raggiungere il CHO obiettivo [g]

# MealData
source: Meal's Data
it: Dati Pasto

# MealCHOGrams
source: Meal's CHO [g]
it: CHO Pasto [g]

source: Accuracy
it: Accuratezza

source: Id Meal
it: Id Pasto

# TooltipMealAccuracyPercent
source: Numerical percent accuracy of the food [%]
it: Accuratezza: percentuale numerica del cibo [%]

# TooltipFoodInMealAccuracyPercent
source: Numerical percent accuracy of the meal [%]
it: Accuratezza: percentuale numerica del pasto [%]

# TooltipMealAccuracyQualitative
source: Qualitative accuracy; accuracy of the food, as a word
it: Accuratezza qualitativa: accuratezza del cibo, come parola

# TooltipFoodInMealAccuracyQualitative
source: Qualitative accuracy; accuracy of the meal, as a word
it: Accuratezza qualitativa: accuratezza del pasto, come parola

# TooltipStartMeal
source: Start: saves the current time as the meal's start time
it: Inizio: salva l'ora corrente come ora di inizio del pasto

# TooltipOpenGlucosePage
source: Glucose: opens the page of measurements of blood glucose
it: Glicemia: apre la pagina delle misurazioni del glucosio

# TooltipOpenBolusCalc
source: Bolus Calculation: opens the page that calculates the units of bolus' injection
it: Calcolo Bolo: apre la pagina che calcola il bolo di insulina per il pasto

# TooltipOpenInjectionsPage
source: Injections: opens the page of injections
it: Iniezioni: apre la pagina delle iniezioni

# TooltipCalcTotalCHO
source: Calculate CHO: sums the total CHO of the meal and calculates its accuracy. Saves the values of the meal's foods.
it: Calcola CHO: calcola la CHO totale del pasto e la sua accuratezza composita. Salva i valori dei cibi.

# TooltipOpenFoodToTargetPage
source: Food to target: opens the page that calculates the amount of food to eat to reach the CHO target.
it: Cibo per obiettivo: apre la pagina per calcolare il cibo per raggiungere l'obiettivo di carboidrati.

source: Food Data
it: Dati Alimento

# TooltipFoodName
source: Name: short name of the food in meal
it: Nome: nome breve dell'alimento nel pasto

source: Unit
it: Unità

# TooltipCalculator
source: Calculate: opens an arithmetic calculator to process the value that currently has the focus
it: Calcola: apre una calcolatrice aritmetica per elaborare il valore correntemente selezionato

# TooltipCHOPercent
source: CHO%: percentuale di carboidrati di questo alimento [%]
it: CHO%: percentuale carboidrati di questo alimento [%]

# TooltipUnitReset
source: Unit: unit of measurement chosen for this food. Click to return to grams.
it: Unità: unità di misura del cibo scelto. Clicca per tornare ai grammi.

# TooltipQuantityUnits
source: Quantity : number of Units of this food in the meal [Unit]
it: Quantità: numero di unità di questo alimento [Unit]

# TooltipCHOGrams
source: CHO: total quantity in grams of carbohydrate in this food of the meal [g]
it: CHO: carboidrati totali in questo alimento in grammi [g]

# TooltipOpenFoodsPage
source: Foods: opens the page to choose and import one food
it: Alimenti: apre la pagina per scegliere ed importare un alimento

# TooltipWeighFood
source: Weigh: opens the page that helps in the weighing of the food
it: Pesa: apre la pagina che aiuta nella pesatura dell'alimento

# TooltipOpenRecipesPage
source: Recipes: opens the page of recipes' management
it: Ricette: apre la pagina di gestione ricette

source: Target Carbs
it: Carboidrati Obiettivo

source: Current Carbs
it: Carboidrati Attuali

source: Carbs Needed
it: Carboidrati Necessari

# SelectFood
source: Select this Food
it: Seleziona questo alimento

source: Quantity Needed
it: Quantità Necessaria

# WeighFoodPageTitle
source: Weigh Food
it: Pesa Alimento

source: Gross Weight
it: Peso Lordo

source: Tare Weight
it: Peso Tara

source: Net Weight
it: Peso Netto

# RecipesPageTitle
source: Recipes
it: Ricette

# RecipeList
source: Recipes List
it: Elenco Ricette

# RecipeIsCooked
source: Cooked recipe: if checked the carbohydrates regard a cooked recipe, if not checked a raw recipe
it: Ricetta cotta: se segnato, i carboidrati riguardano una ricetta cotta, se non segnato una ricetta cruda

# RecipePageTitle
source: Recipe
it: Ricetta

# LabelRecipesDescription
source: Description
it: Descrizione

source: Servings
it: Porzioni

source: Instructions
it: Istruzioni

source: Add Ingredient
it: Aggiungi Ingrediente

source: RemoveIngredient
it: Rimuovi Ingrediente

# InjectionsPageTitle
source: Injections
it: Iniezioni

source: Injections List
it: Elenco Iniezioni

source: Insulin Type
it: Tipo Insulina

source: Injection Site
it: Sito di Iniezione

source: Injection Date/Time
it: Data/Ora Iniezione

# StatisticsPageTitle
source: Statistics
it: Statistiche

source: Period
it: Periodo

source: Average Glucose
it: Glicemia Media

source: Min Glucose
it: Glicemia Minima

source: Max Glucose
it: Glicemia Massima

source: Standard Deviation
it: Deviazione Standard

source: In Range
it: Nel Range

source: Below Range
it: Sotto il Range

source: Above Range
it: Sopra il Range

# ChartPageTitle
source: Chart
it: Grafico

source: Glucose Trend
it: Andamento Glicemia

source: Show last Days
it: Mostra Ultimi Giorni

source: Days
it: Giorni

source: Weeks
it: Settimane

source: Months
it: Mesi

# StatisticsAndGraphPageTitle
source: Statistics and Graph
it: Statistiche e Grafici

source: View Mode
it: Modalità Visualizzazione

source: Daily
it: Giornaliero

source: Weekly
it: Settimanale

source: Monthly
it: Mensile

source: Export
it: Esporta

# AlarmPageTitle
source: Alarms
it: Allarmi

source: Alarms List
it: Elenco Allarmi

source: Enabled
it: Abilitato

source: Disabled
it: Disabilitato

source: Alarm Time
it: Ora Allarme

source: Repeat
it: Ripeti

source: Sound
it: Suono

source: Vibrate
it: Vibrazione

# HypoPredictionPageTitle
source: Hypoglycemia time prediction
it: Previsione Ipoglicemia

source: Current Glucose Level
it: Livello Glicemia Attuale

source: Glucose Trend Rate
it: Tasso Andamento Glicemia

source: Predicted Time
it: Ora Prevista

source: Hypo Threshold
it: Soglia Ipoglicemia

source: Time to Hypo
it: Tempo all'Ipoglicemia

source: General Settings
it: Impostazioni Generali

source: Units Of Measure
it: Unità di Misura

source: Target Range
it: Range Obiettivo

source: Low Threshold
it: Soglia Bassa

source: High Threshold
it: Soglia Alta

# CorrectionParametersPageTitle
source: Correction Parameters
it: Parametri di correzione

source: Insulin Sensitivity Factor
it: Fattore di Sensibilità Insulinica

source: Carb Ratio
it: Rapporto Carboidrati

source: Active Insulin Time
it: Tempo di attività insulina

source: Hours
it: Ore

# ContainersPageTitle
source: Containers (Tare)
it: Contenitori (Tara)

source: Containers List
it: Elenco Contenitori

source: Container Name
it: Nome Contenitore

source: Add Container
it: Aggiungi Contenitore

source: Edit Container
it: Modifica Contenitore

# PhysicalActivityPageTitle
source: Physical Activity
it: Attività Fisica

source: Activity Type
it: Tipo di Attività

source: Duration
it: Durata

source: Intensity
it: Intensità

source: Low
it: Bassa

source: Medium
it: Media

source: High
it: Alta

source: Minutes
it: Minuti

# AboutPageTitle
source: About
it: Informazioni

source: App Version
it: Versione App

source: Developer
it: Sviluppatore

# TooltipRecipesDescription
source: Longer recipe's description
it: Descrizione della ricetta (più lunga)

source: Contact
it: Contatto

source: Privacy Policy
it: Politica Privacy

# MiscellaneousFunctionsPageTitle
source: Miscellaneous Functions
it: Funzioni Varie

# ExportData
source: Export Files and Data
it: Esporta dati e file

source: Import Foods
it: Importa cibi

# LabelImportSensorData
source: Import Sensor Data: click to import glucose measurements from csv file of FreeStyle Libre continuous glucose monitor sensor
it: Importa i dati del sensore: clicca per importare misurazioni del glucosio da file csv del sensore Freestyle Libre

source: Reset Database
it: Reimposta Database

source: View Logs
it: Visualizza Log

source: Clear Logs
it: Cancella Log

source: Restore
it: Ripristina
