Repository: gamondue/GlucoProgs
Catalog: GlucoMan.Maui/Resources/Strings/AppStrings.*.resx
Languages: it

# TooltipEscapeWeighFood
source: Escape: cancel changes and return to the previous page
it: Annulla: annulla le modifiche e torna alla pagina precedente

# TooltipClearWeighFood
source: Clear: erase all the values in the boxes
it: Cancella: cancella tutti i valori nelle caselle

# WeighFoodToGetWeight
source: Weigh food to get weight of portion
it: Pesa il cibo per ottenere il peso della porzione

# NameLabel
source: Name
it: Nome

# RawLabel
source: Raw
it: Crudo

# TooltipRawFood
source: Raw food: if checked the value of CHO% of food is related to raw food. The cooked portion weight will be converted back to raw weight by these calculations
it: Cibo crudo: se selezionato il valore di CHO% del cibo è riferito al cibo crudo. Il peso della porzione cotta verrà convertito in peso crudo da questi calcoli

# TooltipCalculatorFood
source: Open calculator for food calculations
it: Apri calcolatrice per i calcoli del cibo

# WeightDataRawFood
source: Weight data about ALL the food before cooking (raw)
it: Dati di peso su TUTTO il cibo prima della cottura (crudo)

# GrossLabel
source: Gross
it: Lordo

# TareLabel
source: Tare
it: Tara

# NetLabel
source: Net
it: Netto

# TooltipSelectContainer
source: Click to select a container from the list
it: Clicca per selezionare un contenitore dall'elenco

# WeightDataCookedFood
source: Weight data about ALL the food after cooking (cooked)
it: Dati di peso su TUTTO il cibo dopo la cottura (cotto)

# WeightDataCookedPortion
source: Weight data about the cooked portion
it: Dati di peso sulla porzione cotta

source: Weigh the portion
it: Pesa la porzione

# TooltipWeighCookedPortion
source: Weigh the cooked portion: the CHO of the portion will be proportional to the measured weight of the cooked portion
it: Pesa la porzione cotta: i CHO della porzione saranno proporzionali al peso misurato della porzione cotta

source: Equal portions
it: Porzioni uguali

# TooltipEqualPortions
source: Divide all food into equal portions: the portion will be calculated by division of total food by N persons
it: Dividi tutto il cibo in porzioni uguali: la porzione verrà calcolata dividendo il cibo totale per N persone

# NumberOfPortions
source: No of portions
it: N° di porzioni

source: Summary data
it: Dati riassuntivi

# CHOOfPortion
source: CHO[g] of portion
it: CHO[g] della porzione

source: Weight of portion
it: Peso della porzione

source: Raw/Cooked ratio
it: Rapporto Crudo/Cotto

# CropPhotoPageTitle
source: Crop Photo
it: Ritaglia Foto

# CropZoomHint
source: To zoom: 🤏 Pinch | 🖱️ Drag green corners
it: Per ingrandire 🤏 Pizzica | 🖱️ trascina angoli verdi

# CropDragInstruction
source: ⬆️⬇️⬅️➡️ Drag the image to position
it: ⬆️⬇️⬅️➡️ Trascina l'immagine in posizione

# CropResizeInstruction
source: To resize: 🤏 Pinch | 🖱️ Drag green corners
it: Per ridimensionare:🤏 Pizzica | 🖱️ trascina l'angolo verde

# CropCancelButton
source: ✖ Cancel
it: ✖ Annulla

# CropConfirmButton
source: ✂️ Crop
it: ✂️ Ritaglia

source: Calculations of Ratio CHO/insulin
it: Calcolo del rapporto CHO/insulina

# CalculateWithDietist
source: (CALCULATE IT WITH YOUR DIETIST)
it: (FARE IL CALCOLO CON IL DIETISTA!)

# CalculationsToBeImplemented
source: Calculations to be implemented yet
it: Programma di calcolo ancora da realizzare

# BreakfastLabel
source: Breakfast
it: Colazione

# LunchLabel
source: Lunch
it: Pranzo

# DinnerLabel
source: Dinner
it: Cena

# BreakfastRatioPlaceholder
source: Break.ratio
it: Rapp. colazione

# LunchRatioPlaceholder
source: Lunch ratio
it: Rapporto.Pranzo

# DinnerRatioPlaceholder
source: Dinn.ratio
it: Rapporto.Cena

# TooltipBreakfastRatio
source: Carbohydrates per unit of insulin - breakfast time
it: Carboidrati per unità di insulina- ora di colazione

# TooltipLunchRatio
source: Carbohydrates per unit of insulin - lunch time
it: Carboidrati per unità di insulina- ora di pranzo

# TooltipDinnerRatio
source: Carbohydrates per unit of insulin - dinner time
it: Carboidrati per unità di insulina- ora di cena

# TooltipSaveRatioCHOInsulin
source: Save: saves the sensitivities of carbohydrates to be used in the rest of the program
it: Salva: salva le sensibilità ai carboidrati (usate dal resto del programma)

source: Calculation of insulin sensitivity
it: Calcolo della sensibilità all'insulina

# TypicalBolusesPerDay
source: Typical boluses made during a day [U]
it: Totale dei boli tipici fatti durante un giorno

# MorningLabel
source: morning
it: mattino

# MiddayLabel
source: midday
it: metà giornata

# EveningLabel
source: evening
it: pomeriggo

# LongLabel
source: long
it: lunga

# BolusPlaceholder
source: bolus [Ui]
it: bolo [Ui]

# TooltipTypicalBolusMorning
source: Typical amount of bolus of short duration insulin at morning
it: Bolo tipico di insulina ad azione breve al mattino

# TooltipTypicalBolusMidday
source: Typical amount of bolus of short duration insulin at midday
it: Bolo tipico di insulina ad azione breve a mezzogiorno

# TooltipTypicalBolusEvening
source: Typical amount of bolus of short duration insulin at evening
it: Bolo tipico di insulina ad azione breve alla sera

# TooltipTypicalBolusNight
source: Typical amount of bolus of long duration insulin once a day
it: Bolo tipico di insulina ad azione lenta una volta al giorno

# SensFactorLabel
source: Sens.factor
it: Fattore di sensibilità

# SensToInsulinLabel
source: Sens.to insul.
it: Sens.a insul.

# TooltipTDD
source: Total Daily Dose; sum of typical value of every kind of insulin in a day
it: Somma dei valori tipici di tutti i tipi di insulina in un giorno (Total Daily Dose )

# TooltipSensitivityFactor
source: Coefficient that divides the total day insulin to obtain the sensitivity (Typical values taken from scientific literature)
it: Coefficiente che divide la insulina totale tipica in un giorno per ottenere la sensibilità (valori tipici usati nella letteratura scientifica)

# TooltipCalculateInsulinSensitivity
source: Calculates sensitivity to insulin (sum of day insulin injections / chosen coefficient)
it: Calcola la sensibilità all'insulina (somma dell'insulina iniettata in un giorno / coefficiente scelto)

# TooltipSaveInsulinSensitivity
source: Save: saves the sensitivity as a parameter of the program
it: Salva: salva la sensibilità come parametro del programma

source: Physical Activity parameters
it: Parametri per Attività Fisica

# SensitivityFactorPickerTitle
source: pick value
it: Scegli un valore

# SettingsPageTitle
source: Settings
it: Impostazioni

source: Insulin Settings
it: Impostazioni Insulina

source: Short Acting Insulin
it: Insulina ad azione rapida

# TooltipShortActingInsulin
source: Name of the chosen short acting insulin
it: Nome dell'insulina ad azione rapida scelta

# DurationShortActingInsulin
source: Duration of short acting insulin
it: Durata insulina ad azione rapida

# TooltipDurationShortActingInsulin
source: Duration of the chosen short acting insulin
it: Durata dell'insulina ad azione rapida scelta

source: Long Acting Insulin
it: Insulina ad azione lenta

# TooltipLongActingInsulin
source: Name of the chosen long acting insulin
it: Nome dell'insulina ad azione lenta scelta

# DurationLongActingInsulin
source: Duration of long acting insulin
it: Durata insulina ad azione lenta

# TooltipDurationLongActingInsulin
source: Duration of the chosen long acting insulin
it: Durata dell'insulina ad azione lenta scelta

source: Data Display Settings
it: Impostazioni Visualizzazione Dati

# MonthsDataShownInGrids
source: Months of data shown in the grids
it: Mesi di dati mostrati nelle griglie

# TooltipMonthsDataShown
source: Months shown: month of data that will be shown in the grids of the program
it: Mesi visualizzati: mese di dati che verranno mostrati nelle griglie del programma

# MealTimeSettings
source: Meal Time Settings (Not used yet)
it: Impostazioni Orari Pasti (Non ancora usato)

source: Initial time for breakfast
it: Ora iniziale per colazione

# TooltipInitialTimeBreakfast
source: Start day hour of breakfast in hours [0.0-24.0]
it: Ora iniziale del giorno per colazione in ore [0.0-24.0]

source: Final time for breakfast
it: Ora finale per colazione

# TooltipFinalTimeBreakfast
source: Finish day hour of breakfast in hours [0.0-24.0]
it: Ora finale del giorno per colazione in ore [0.0-24.0]

source: Initial time for lunch
it: Ora iniziale per pranzo

# TooltipInitialTimeLunch
source: Start day hour of lunch in hours [0.0-24.0]
it: Ora iniziale del giorno per pranzo in ore [0.0-24.0]

source: Final time for lunch
it: Ora finale per pranzo

# TooltipFinalTimeLunch
source: Finish day hour of lunch in hours [0.0-24.0]
it: Ora finale del giorno per pranzo in ore [0.0-24.0]

source: Initial time for dinner
it: Ora iniziale per cena

# TooltipInitialTimeDinner
source: Start day hour of dinner in hours [0.0-24.0]
it: Ora iniziale del giorno per cena in ore [0.0-24.0]

source: Final time for dinner
it: Ora finale per cena

# TooltipFinalTimeDinner
source: Finish day hour of dinner in hours [0.0-24.0]
it: Ora finale del giorno per cena in ore [0.0-24.0]

# TooltipSaveSettings
source: Save: save the parameters in the database
it: Salva: salva i parametri nel database

# CookedToRawRatio
source: Cooked to raw ratio: ratio between the cooked weight and the raw weight of the recipe
it: Rapporto crudo/cotto: rapporto fra il peso da crudo del cibo ed il suo peso da cotto

# TooltipTotalCHOOfMeal
source: Total CHO of Meal: sum of the CHO in grams of the foods in the meal
it: CHO totale del pasto: somma delle CHO in grammi dei cibi del pasto

# ChartImageToClick
source: Chart: click to open chart page with graphical data visualization
it: Grafico: click per aprire una pagina che visualizza un grafico dei dati

# LabelRoundButton
source: Round insulin
it: Arrotonda insulina

# labelNoOfWeeks
source: No of Weeks
it: N. settimane

# IdentificationPageTitle
source: Parameters' identification
it: Identificazione dei parametri

source: Import Database
it: Importa database

# TooltipImportDatabase
source: Substitutes the current database with user's chosen file
it: Sostituisce il database attuale con quello scelto dall'utente

# TooltipExportFiles
source: Export "interesting" Files and Data to "GlucoMan" folder inside "Download", from which they can be read
it: Esporta dati e file d'interesse nella cartella "GlucoMan"dentro "Download", da dove possono essere letti

# TooltipResetDatabase
source: Reset database, starting from scratch with no data
it: Ricomincia daccapo, rigenerando il database senza dati

# TooltipImportFoods
source: Import in this database all foods in another database
it: Importa in questo database tutti i cibi presenti in un altro

# TooltipStopAppllcation
source: Completely stops this program
it: Ferma completamente questo programma

source: Stop application
it: Ferma il programma

# TooltipViewLogs
source: Opens and shows the content of the error log file
it: Apre e mostra il contenuto del file di log errori

# TooltipClearAllLogs
source: Deletes the content of all log files of the program
it: Cancella il contenuto di tutti i file di log del programma

source: Menu
it: Menù

# TooltipMenu
source: Opens the main page
it: Apre la pagina principale
